src/Catalogs/ТипыИнцидентов/ТипыИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыИнцидентов</name>
  <attributes>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокАдм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЦКК</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ОбнаружениеИнцидентов</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ТипыИнцидентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ТипИнцидента(ТипИнцидентаПредставление, УровеньИнцидента) Экспорт
    
    ХешТипа = Справочники.ТипыИнцидентов.ХешТипИнцидента(ТипИнцидентаПредставление);
    Возврат СоздатьЭлементПоХешу(ХешТипа, ТипИнцидентаПредставление, УровеньИнцидента);
    
КонецФункции

Функция СсылкаПоНаименованию(Наименование) Экспорт
	Возврат Справочники.ТипыИнцидентов.НайтиПоНаименованию(Наименование);
КонецФункции

Функция СсылкаПоХешу(ХешТипа) Экспорт
	Возврат Справочники.ТипыИнцидентов.НайтиПоРеквизиту("ХешТипа", ХешТипа);
КонецФункции

Функция СоздатьЭлементПоНаименованию(Наименование, ПараметрыСоздания = Неопределено) Экспорт
	
	Ссылка = СсылкаПоНаименованию(Наименование);
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Попытка
			НачатьТранзакцию();
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ТипыИнцидентов");
			ЭлементБлокировки.УстановитьЗначение("Наименование", Наименование);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Ссылка = СсылкаПоНаименованию(Наименование);
			
            Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
                
                Ответственный = Неопределено;
                УровеньИнцидента = Неопределено;
                ОбъектЦКК = Неопределено;
                Подсистема = Неопределено;
                
                Если ПараметрыСоздания = Неопределено Тогда
                    ПараметрыСоздания = Новый Структура("УровеньИнцидента", Перечисления.УровниИнцидентов.Предупреждение);
                КонецЕсли;
                                
                ПараметрыСоздания.Свойство("Ответственный", Ответственный);
                ПараметрыСоздания.Свойство("УровеньИнцидента", УровеньИнцидента);
                ПараметрыСоздания.Свойство("ОбъектЦКК", ОбъектЦКК);
                ПараметрыСоздания.Свойство("Подсистема", Подсистема);
                
				ТипИнцидента = Справочники.ТипыИнцидентов.СоздатьЭлемент();
				ТипИнцидента.Наименование = Наименование;
                ТипИнцидента.Подсистема = Подсистема;
				ТипИнцидента.Ответственный = Ответственный;
				ТипИнцидента.УровеньИнцидента = УровеньИнцидента;
				ТипИнцидента.ОбъектЦКК = ОбъектЦКК;
				ТипИнцидента.Записать();
				
				Ссылка = ТипИнцидента.Ссылка;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция ПараметрыСозданияПоУмолчанию(Ответсвенный, УровеньИнцидента, ОбъектЦКК) Экспорт
    
    Возврат Новый Структура("Ответсвенный, УровеньИнцидента, ОбъектЦКК", Ответсвенный, УровеньИнцидента, ОбъектЦКК);
    
КонецФункции

Функция СоздатьЭлементПоХешу(ХешТипа, Наименование, УровеньИнцидента) Экспорт
    
    Ссылка = СсылкаПоХешу(ХешТипа);
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Попытка
			НачатьТранзакцию();
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ТипыИнцидентов");
			ЭлементБлокировки.УстановитьЗначение("ХешТипа", ХешТипа);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Ссылка = СсылкаПоХешу(ХешТипа);
			
            Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
                
                Ответственный = Неопределено;
                ОбъектЦКК = Неопределено;
                Подсистема = Неопределено;
               
				ТипИнцидента = Справочники.ТипыИнцидентов.СоздатьЭлемент();
				ТипИнцидента.Наименование = Наименование;
                ТипИнцидента.Подсистема = Подсистема;
				ТипИнцидента.Ответственный = Ответственный;
				ТипИнцидента.УровеньИнцидента = УровеньИнцидента;
				ТипИнцидента.ОбъектЦКК = ОбъектЦКК;
                ТипИнцидента.ХешТипа = ХешТипа;
				ТипИнцидента.Записать();
				
				Ссылка = ТипИнцидента.Ссылка;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	Возврат Ссылка;
    
КонецФункции

Функция ХешТипИнцидента(Данные) Экспорт
    
    ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
    ХешированиеДанных.Добавить(Данные);
    
    Возврат СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
    
КонецФункции

#КонецОбласти

#КонецЕсли
